{
  "AI/ML Engineer": "Develops machine learning models using Python, TensorFlow, PyTorch, and works with data for pattern recognition and automation.",
  "Data Scientist": "Performs data analysis using statistics, machine learning, Python, and tools like Pandas, NumPy, and Jupyter.",
  "Web Developer": "Builds websites and web apps using HTML, CSS, JavaScript, React, and backend frameworks like Node.js or Django.",
  "Android Developer": "Creates Android apps using Java/Kotlin, Android Studio, and integrates with APIs and databases.",
  "iOS Developer": "Builds iOS applications using Swift, Xcode, and Apple SDKs for various mobile use cases.",
  "Full Stack Developer": "Handles both frontend and backend using React, Node.js, Express, and databases like MongoDB or PostgreSQL.",
  "Frontend Developer": "Focuses on UI/UX and builds the client side of web apps using HTML, CSS, JavaScript, and frontend frameworks.",
  "Backend Developer": "Builds APIs and server logic using Python, Java, Node.js, and handles databases and integrations.",
  "DevOps Engineer": "Automates deployment and manages CI/CD pipelines with Docker, Kubernetes, Jenkins, AWS, and GitOps.",
  "Cybersecurity Analyst": "Monitors systems for threats, manages firewalls, handles security audits, and uses tools like Wireshark and Splunk.",
  "Cloud Engineer": "Designs and maintains cloud infrastructure on AWS, Azure, or GCP including VMs, storage, and networking.",
  "Network Engineer": "Maintains network infrastructure, configures routers/switches, and ensures reliable data communication.",
  "Database Administrator": "Designs and maintains databases like MySQL, PostgreSQL, or Oracle, handles backups, and optimizes queries.",
  "Data Analyst": "Extracts insights using SQL, Excel, Power BI, Tableau, and supports business decisions with reports.",
  "Business Analyst": "Bridges business needs with technical teams, gathers requirements, and creates user stories and documentation.",
  "Project Manager": "Plans, executes, and delivers projects using tools like Jira, Asana, Agile/Scrum methodologies.",
  "UI/UX Designer": "Designs intuitive user interfaces using Figma, Adobe XD, and conducts user testing and wireframing.",
  "Graphic Designer": "Creates visual content using Photoshop, Illustrator, and InDesign for digital and print media.",
  "Content Writer": "Writes blogs, product descriptions, and technical documents with focus on SEO and readability.",
  "Technical Writer": "Creates clear documentation, API docs, manuals using Markdown, DITA, and documentation platforms.",
  "Mechanical Engineer": "Designs mechanical systems, uses CAD software, performs simulations and works with materials.",
  "Civil Engineer": "Supervises construction, works with AutoCAD, STAAD Pro, manages infrastructure projects.",
  "Electrical Engineer": "Works with circuits, PCB design, embedded systems, and electrical equipment.",
  "Electronics Engineer": "Designs and tests electronic systems and hardware using microcontrollers and digital logic.",
  "Embedded Systems Engineer": "Programs microcontrollers using C/C++, works with real-time systems and IoT devices.",
  "System Administrator": "Manages servers, user accounts, system configurations, and scripting using Bash or PowerShell.",
  "Digital Marketer": "Runs campaigns, SEO, SEM, social media marketing, and analytics using tools like Google Ads, Hubspot.",
  "HR Manager": "Handles recruitment, employee engagement, payroll, and HR tools like Workday or SAP.",
  "Fashion Designer": "Creates apparel and accessories using design tools and knowledge of fashion trends and textiles.",
  "Biotech Researcher": "Conducts lab experiments, analyzes data in genetics, molecular biology, and uses lab tools.",
  "Legal Associate": "Works on contracts, legal research, client management, and compliance documentation.",
  "Finance Analyst": "Performs financial forecasting, valuation models, Excel, and tools like Bloomberg or Power BI.",
  "Supply Chain Analyst": "Optimizes logistics, inventory, procurement using SAP, Excel, and analytics tools.",
  "Game Developer": "Builds video games using Unity or Unreal Engine, C#/C++, and 3D modeling tools.",
  "Product Manager": "Defines product roadmap, gathers feedback, coordinates with design/dev teams, and analyzes KPIs."
}
